FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SPI.c
/*-------------------------------------------------------------------------*
 * File:  SPI.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC546xx SPI Bus Interface.
 * Implementation:
 *      Two SPIs are created, SPI0 and SPI1 and SPI2.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include "LPC546xx_SPI.h"
#include "Config.h"
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <uEZPlatform.h>
#include <HAL/GPIO.h>
#include <HAL/Interrupt.h>

//TODO: Remove
#include "iar/Include/CMSIS/LPC54608.h"
/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    TUInt8 RESERVED_0[1024];
    TUInt32 iCFG;
    TUInt32 iDLY;
    TUInt32 iSTAT;
    TUInt32 iINTENSET;
    TUInt32 iINTENCLR;
    TUInt8 RESERVED_1[16];
    TUInt32 iDIV;
    TUInt32 iINTSTAT;
    TUInt8 RESERVED_2[2516];
    TUInt32 iFIFOCFG;
    TUInt32 iFIFOSTAT;
    TUInt32 iFIFOTRIG;
    TUInt8 RESERVED_3[4];
    TUInt32 iFIFOINTENSET;
    TUInt32 iFIFOINTENCLR;
    TUInt32 iFIFOINTSTAT;
    TUInt8 RESERVED_4[4];
    TUInt32 iFIFOWR;
    TUInt8 RESERVED_5[12];
    TUInt32 iFIFORD;
    TUInt8 RESERVED_6[12];
    TUInt32 iFIFORDNOPOP;
    TUInt8 RESERVED_7[440];
    TUInt32 iID;
} T_LPC546xx_SPI_Registers;

typedef struct {
    const HAL_SPI *iHAL;
    T_LPC546xx_SPI_Registers *iReg;
    T_spiCompleteCallback iCompleteCallback;
    void *iCompleteCallbackWorkspace;
    SPI_Request *iRequest;
    T_irqChannel iIRQChannel;
    TBool iIsBusy;
} T_LPC546xx_SPI_Workspace;

/*---------------------------------------------------------------------------*
 * Function Prototypes:
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( ISPI6IRQ );
static void ISPIEnd(SPI_Request *aRequest);
static void ISPIProcessInterrupt(T_LPC546xx_SPI_Workspace *aW);
static void ISPIOutput(T_LPC546xx_SPI_Workspace *aW);

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
static T_LPC546xx_SPI_Workspace *G_SPI0Workspace;
static T_LPC546xx_SPI_Workspace *G_SPI6Workspace;

/*---------------------------------------------------------------------------*
 * Routine: ISPIxIRQ
 *---------------------------------------------------------------------------*
 * Description:
 *      Capture the SPIx interrupts and forward to ISPIProcessInterrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( ISPI6IRQ )
{
    IRQ_START();
    ISPIProcessInterrupt(G_SPI0Workspace);
    IRQ_END();
}


/*---------------------------------------------------------------------------*
 * Routine: ISPIProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Generic routine for handling any of the SPI interrupts.
 *      NOTE: This routine is ALWAYS processed inside of a interrupt
 *              service routine.
 * Inputs:
 *      T_SerialPortEntry *p      -- Port's definition to process interrupt
 *---------------------------------------------------------------------------*/
static void ISPIProcessInterrupt(T_LPC546xx_SPI_Workspace *aW)
{
    T_LPC546xx_SPI_Registers *p = aW->iReg;
    SPI_Request *r = aW->iRequest;
    TUInt8 ris;
    TUInt32 data;

    while (1) {
        // Do we have any interrupts to process now?
        ris = p->iFIFOSTAT;
        if (!ris)
            break;

        // Is data waiting to be received?
        if (ris & ((1<<6))) {//RXNOTEMPTY
            // Pull the data out of the SPI peripheral
            if (r->iNumTransferredIn < r->iNumTransfers) {
                data = p->iFIFORD & 0xFF;
                if (r->iDataMISO)
                    ((TUInt8 *)r->iDataMISO)[r->iNumTransferredIn++] = data;
            }

            // If we have reached the end, we are done
            if (r->iNumTransferredIn >= r->iNumTransfers) {
                // No more processing.  Stop here.
                InterruptDisable(aW->iIRQChannel);

                // Clear any remaining interrupts
                p->iFIFOINTSTAT = 0;//TODO: Check

                // Mask out all interrupts
                p->iFIFOINTENCLR = 0;

                // End the chip select
                ISPIEnd(aW->iRequest);

                // Note we are done
                aW->iIsBusy = EFalse;

                // Call the completion callback (if any)
                if (aW->iCompleteCallback) {
                    aW->iCompleteCallback(aW->iCompleteCallbackWorkspace,
                        aW->iRequest);
                }

                break;
            } else {
                // Not done yet.
                // Ensure if we had an interrupt on a stalled receive, clear it
                //p->iICR = SPI_RORIC;
            }
        } else if (ris & (!(1<<4))) { //TXEMPTY
            ISPIOutput(aW);
        } else {
            // Some other interrupt.  Just clear it.  Possibly an error.
            p->iFIFOINTENCLR = 0;
        }
    }

