FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SPI.c
}

/*---------------------------------------------------------------------------*
 * Routine:  ISPIStart
 *---------------------------------------------------------------------------*
 * Description:
 *      SPI is going to start -- chip select enabled for device
 * Outputs:
 *      SPI_Request *aRequest      -- Configuration of SPI device
 *---------------------------------------------------------------------------*/
static void ISPIStart(SPI_Request *aRequest)
{
    if (aRequest->iCSPolarity) {
        (*aRequest->iCSGPIOPort)->Set(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    } else {
        (*aRequest->iCSGPIOPort)->Clear(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISPIEnd
 *---------------------------------------------------------------------------*
 * Description:
 *      SPI is going to end -- chip select disabled for device
 * Outputs:
 *      SPI_Request *aRequest      -- Configuration of SPI device
 *---------------------------------------------------------------------------*/
static void ISPIEnd(SPI_Request *aRequest)
{
    if (aRequest->iCSPolarity) {
        (*(aRequest->iCSGPIOPort))->Clear(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    } else {
        (*(aRequest->iCSGPIOPort))->Set(aRequest->iCSGPIOPort,
                aRequest->iCSGPIOBit);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ISPIConfig
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the SPI for the particular SPI request.
 * Outputs:
 *      T_LPC546xx_SPI_Workspace *aW -- Particular SPI workspace
 *      SPI_Request *aRequest      -- Configuration of SPI device
 *---------------------------------------------------------------------------*/
static void ISPIConfig(T_LPC546xx_SPI_Workspace *aW, SPI_Request *aRequest)
{
    T_LPC546xx_SPI_Registers *p = aW->iReg;
    TUInt32 scr;
    TUInt32 dmy;

    // Set the CS as an output io pin
    (*(aRequest->iCSGPIOPort))->SetOutputMode(aRequest->iCSGPIOPort,
            aRequest->iCSGPIOBit);

    // Make sure the SPI clock is main/2
    p->iDIV = 1;
    // Calculate the scr prescalar
    scr = ((Fpclk/1000)/(p->iDIV * aRequest->iRate));
    // If too fast, run it down one more divider (this happenes when not
    // exactly on the right divider)
    while (((Fpclk/1000)/(p->iDIV * scr)) > aRequest->iRate)
        scr++;
    // Final value of scr is one less
    scr--;

    p->iCFG = (1<<2) | (aRequest->iClockOutPolarity ? (1<<5) : 0) |
                       (aRequest->iClockOutPhase ? (1<<4) : 0);
    
    p->iFIFOWR |= (aRequest->iBitsPerTransfer - 1) << 24;

    // Enable the SPI
    p->iCFG |= 1;

    // Clear out the SPI buffer
    while (p->iFIFOSTAT & (1<<6))
        dmy = p->iFIFORD;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SPI_TransferPolled
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a SPI transfer (both read and write) out the SPI port using
 *      the given request. CS should be set as a GPIO output before calling
 *      this functions.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- Request to perform
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SPI_TransferPolled(void *aWorkspace, SPI_Request *aRequest)
{
    TUInt32 i;
    T_LPC546xx_SPI_Workspace *aW = (T_LPC546xx_SPI_Workspace *)aWorkspace;
    T_LPC546xx_SPI_Registers *p = aW->iReg;
    TUInt8 *p_dataMOSI8;
    TUInt8 *p_dataMISO8;
    TUInt16 *p_dataMOSI16;
    TUInt16 *p_dataMISO16;
    TVUInt32 dummy;
    int isToggling = aRequest->iFlags & SPI_REQUEST_TOGGLING_CS;

    // No interrupt processing
    InterruptDisable(aW->iIRQChannel);

    // Setup SPI for this configuration
    ISPIConfig(aW, aRequest);

    // Start SPI
    ISPIStart(aRequest);

    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer == 1) {
//        // Optimized version for 1 byte
//        // Wait for SPI to be no longer busy and transmit to be empty
//        while ((p->iSR & SPI_BSY) || (!(p->iSR & SPI_TFE))) {
//            // TBD: Polling here instead of interrupt
//        }
//        p->iDR = (TUInt32)((aRequest->iDataMOSI)?*((TUInt8 *)aRequest->iDataMOSI):0xFF);
//        // Wait until SPI done  (transmit empty)
//        while ((p->iSR & SPI_BSY) || ((p->iSR & SPI_TFE) == 0)) {
//            // TBD: For polling this is fine, but we may need to yield at some point?
//        }
//        dummy = p->iDR;
//        if (aRequest->iDataMISO)
//            *((TUInt8 *)aRequest->iDataMISO) = dummy;
    } else if (aRequest->iBitsPerTransfer <= 8) {
        // Doing bytes
        p_dataMOSI8 = (TUInt8 *)(aRequest->iDataMOSI);
        p_dataMISO8 = (TUInt8 *)(aRequest->iDataMISO);

        for (i = 0; i < aRequest->iNumTransfers; i++) {
            // Wait for SPI to be no longer busy and transmit to be empty
            while ((p->iFIFOINTSTAT & !(1<<4)) != 0) {
                // TBD: Polling here instead of interrupt
            }

            if (isToggling) {
                ISPIStart(aRequest);
            }
            if (p_dataMOSI8) {
                // Send the SPI data (this also triggers a read in)
                if (((i + 4) <= aRequest->iNumTransfers) && (!isToggling)) {
                    // Do 4 at one time
                    p->iFIFOWR = (TUInt32)*(p_dataMOSI8++);
                    p->iFIFOWR = (TUInt32)*(p_dataMOSI8++);
                    p->iFIFOWR = (TUInt32)*(p_dataMOSI8++);
                    p->iFIFOWR = (TUInt32)*(p_dataMOSI8++);
                } else {
                    p->iFIFOWR = (TUInt32)*(p_dataMOSI8++);
                }
            } else {
                // Send the SPI data (this also triggers a read in)
                if (((i + 4) <= aRequest->iNumTransfers) && (!isToggling)) {
                    // Do 4 at one time
                    p->iFIFOWR = (TUInt32)0xFF;
                    p->iFIFOWR = (TUInt32)0xFF;
                    p->iFIFOWR = (TUInt32)0xFF;
                    p->iFIFOWR = (TUInt32)0xFF;
                } else {
                    p->iFIFOWR = (TUInt32)0xFF;
                }
            }

