FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SPI.c
            // Wait until SPI done  (transmit empty)
            while ((p->iFIFOINTSTAT & (1<<4) != 0)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Store the SPI received over the data sent
            if (p_dataMISO8) {
                // Store the SPI received over the data sent
                if (((i + 4) <= aRequest->iNumTransfers) && (!isToggling)) {
                    // Do 4 at one time
                    *(p_dataMISO8++) = p->iFIFORD;
                    *(p_dataMISO8++) = p->iFIFORD;
                    *(p_dataMISO8++) = p->iFIFORD;
                    *(p_dataMISO8++) = p->iFIFORD;
                    i += 3;
                } else {
                    *(p_dataMISO8++) = p->iFIFORD;
                }
            } else {
                // Store the SPI received over the data sent
                if (((i + 4) <= aRequest->iNumTransfers) && (!isToggling)) {
                    // Do 4 at one time
                    dummy = p->iFIFORD;
                    dummy = p->iFIFORD;
                    dummy = p->iFIFORD;
                    dummy = p->iFIFORD;
                    i += 3;
                } else {
                    dummy = p->iFIFORD;
                }
            }
            if (isToggling) {
                ISPIEnd(aRequest);
            }
        }
    } else {
        // Doing words
        p_dataMOSI16 = (TUInt16 *)(aRequest->iDataMOSI);
        p_dataMISO16 = (TUInt16 *)(aRequest->iDataMISO);

        for (i = 0; i < aRequest->iNumTransfers; i++) {
            // Wait for SPI to be no longer busy and transmit to be empty
            while ((p->iFIFOINTSTAT & (1<<4) != 0)) {
                // TBD: Polling here instead of interrupt
            }

            // Send the SPI data (this also triggers a read in)
            if (p_dataMOSI16)
                p->iFIFOWR = (TUInt32)*(p_dataMOSI16++);
            else
                p->iFIFOWR = 0xFFFF;

            // Wait until SPI done
            while ((p->iFIFOINTSTAT & (1<<4) != 0)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Store the SPI received over the data sent
            if (p_dataMISO16)
                *(p_dataMISO16++) = p->iFIFORD;
            else
                dummy = p->iFIFORD;
        }
    }

    // Do this to get rid of warning in compiler that dummy is set but not used
    VARIABLE_NOT_USED(dummy);

    // End SPI
    ISPIEnd(aRequest);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SPI_SPI1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC546xx SPI1 workspace.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC546xx_SPI_SPI6_InitializeWorkspace(void *aWorkspace)
{
    T_LPC546xx_SPI_Workspace *p = (T_LPC546xx_SPI_Workspace *)aWorkspace;
    p->iReg = (T_LPC546xx_SPI_Registers *)SPI6;

    G_SPI6Workspace = p;
    p->iIsBusy = EFalse;
    p->iIRQChannel = FLEXCOMM6_IRQn;

    //Turn on peripheral clock


    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SPI_Start
 *---------------------------------------------------------------------------*
 * Description:
 *      Start a SPI transfer by putting the chip select in the active state
 *      after configuring the SPI speed and other settings.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- SPI request being processed
 *---------------------------------------------------------------------------*/
void LPC546xx_SPI_Start(void *aWorkspace, SPI_Request *aRequest)
{
    // Setup SPI for this configuration
    ISPIConfig(aWorkspace, aRequest);
    ISPIStart(aRequest);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SPI_TransferInOut
 *---------------------------------------------------------------------------*
 * Description:
 *      Do a single SPI transfer to the SPI device.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- SPI request being processed
 *      TUInt32 aSend               -- Item to transfer
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static TUInt32 LPC546xx_SPI_TransferInOut(
        void *aWorkspace,
        SPI_Request *aRequest,
        TUInt32 aSend)
{
    TUInt32 recv;
    T_LPC546xx_SPI_Workspace *aW = (T_LPC546xx_SPI_Workspace *)aWorkspace;
    T_LPC546xx_SPI_Registers *p = aW->iReg;

    // Are we transferring byte sized or word sized?
    if (aRequest->iBitsPerTransfer <= 8) {
        // Send the SPI data (this also triggers a read in)
        p->iFIFOWR = aSend;

        // Wait until SPI done
        while ((p->iFIFOINTSTAT & (1<<4) != 0)) {
            // TBD: For polling this is fine, but we may need to yield at some point?
        }

        // Store the SPI received over the data sent
        recv = p->iFIFORD;
    } else {
        // Send the SPI data (this also triggers a read in)
        p->iFIFOWR = (TUInt32)*((TUInt16 *)aSend);

        // Wait until SPI done
        while ((p->iFIFOINTSTAT & (1<<6))) {
            // TBD: For polling this is fine, but we may need to yield at some point?
        }

        // Store the SPI received over the data sent
        recv = p->iFIFORD;
    }

    return recv;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SPI_Stop
 *---------------------------------------------------------------------------*
 * Description:
 *      End a SPI transfer by putting the chip select in the done state.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- SPI request being processed
 *---------------------------------------------------------------------------*/
static void LPC546xx_SPI_Stop(void *aWorkspace, SPI_Request *aRequest)
{
    ISPIEnd(aRequest);
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC546xx_SPI_SPI1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Transfer a set of SPI bytes (in the request) to the given
 *      target.  Works similarly to TransferPolled except this routine
 *      does not affect the chip select state.
 * Inputs:
 *      void *aW                    -- Particular SPI workspace
 *      SPI_Request *aRequest       -- SPI request being processed
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError LPC546xx_SPI_TransferInOutBytes(
        void *aWorkspace,
        SPI_Request *aRequest)
{
    T_LPC546xx_SPI_Workspace *aW = (T_LPC546xx_SPI_Workspace *)aWorkspace;
    T_LPC546xx_SPI_Registers *p = aW->iReg;
    TUInt32 sent;
    TUInt32 count;
    TUInt8 *p_dataMOSI = (TUInt8 *)aRequest->iDataMOSI;
    TUInt8 *p_dataMISO = (TUInt8 *)aRequest->iDataMISO;
    TUInt8 dummy[8];

    // This routine only works with transfer of 8 bits or lower
    if (aRequest->iBitsPerTransfer > 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    sent = 0;
    count = aRequest->iNumTransfers;

    // Send data while there is data to send
    while (sent < count) {
        if (!aRequest->iDataMISO)
            p_dataMISO = dummy;

        // Always send in groups of 8 bytes if there are 8 bytes to send
        if ((sent + 8) <= count) {
            // Send 8
            if (!aRequest->iDataMOSI) {
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
                p->iFIFOWR = 0xFF;
            } else {
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
                p->iFIFOWR = *(p_dataMOSI++);
            }

            // Wait until SPI done
            while ((p->iFIFOINTSTAT & (1<<4) != 0)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Receive 8
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;
            *(p_dataMISO++) = p->iFIFORD;

            sent += 8;
        } else {
            // There are now less than 8 bytes to send, send
            // one at a time.

            // Send 1
            if (!aRequest->iDataMOSI) {
                p->iFIFOWR = 0xFF;
            } else {
                p->iFIFOWR = *(p_dataMOSI++);
            }
            // Wait until SPI done
            while ((p->iFIFOINTSTAT & (1<<4) != 0)) {
                // TBD: For polling this is fine, but we may need to yield at some point?
            }

            // Receive 1
            *(p_dataMISO++) = p->iFIFORD;

            sent++;
        }
    }

    return UEZ_ERROR_NONE;
}

static void ISPIOutput(T_LPC546xx_SPI_Workspace *aW)
{
    T_LPC546xx_SPI_Registers *p = aW->iReg;
    SPI_Request *r = aW->iRequest;
    TUInt32 num;
    TUInt8 *p_dataMOSI8;

    // Is there any room to send data?
    num = r->iNumTransfers - r->iNumTransferredOut;
    if (r->iDataMOSI) {
        // Output bytes from the array
        if (num >= 4) {
            p_dataMOSI8 = ((TUInt8 *)r->iDataMOSI) + r->iNumTransferredOut;
            p->iFIFOWR = p_dataMOSI8[0];
            p->iFIFOWR = p_dataMOSI8[1];
            p->iFIFOWR = p_dataMOSI8[2];
            p->iFIFOWR = p_dataMOSI8[3];
            r->iNumTransferredOut+=4;
        } else if (num) {
            // Output all we got left
            p_dataMOSI8 = ((TUInt8 *)r->iDataMOSI) + r->iNumTransferredOut;
            while (num--) {
                p->iFIFOWR = *(p_dataMOSI8++);
                r->iNumTransferredOut++;
            }
        } else {
            // No longer report interrupts for room to transfer,
            // we are out of bytes to transfer.

