FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC546xx/LPC546xx_SPI.c
        }
    } else {
        // Output 0xFF's
        if (num >= 4) {
            // Output 4 in a bunch
            p->iFIFOWR = 0xFF;
            p->iFIFOWR = 0xFF;
            p->iFIFOWR = 0xFF;
            p->iFIFOWR = 0xFF;
            r->iNumTransferredOut += 4;
        } else if (num) {
            // Output the remaining
            while (num--) {
                p->iFIFOWR = 0xFF;
                r->iNumTransferredOut++;
            }
        } else {
            // There is no more to output, stop doing interrupts

        }
    }
}

static T_uezError LPC546xx_SPI_TransferNoBlock(
        void *aWorkspace,
        SPI_Request *aRequest,
        T_spiCompleteCallback aCallback,
        void *aCallbackWorkspace)
{
    T_LPC546xx_SPI_Workspace *aW = (T_LPC546xx_SPI_Workspace *)aWorkspace;
    T_LPC546xx_SPI_Registers *p = aW->iReg;

    // This routine only works with transfer of 8 bits or lower
    if (aRequest->iBitsPerTransfer > 8)
        return UEZ_ERROR_INVALID_PARAMETER;

    // Disable any potential SPI interrupts
    InterruptDisable(aW->iIRQChannel);

    aRequest->iNumTransferredOut = 0;
    aRequest->iNumTransferredIn = 0;

    // Setup the callback and the parameters
    aW->iCompleteCallback = aCallback;
    aW->iCompleteCallbackWorkspace = aCallbackWorkspace;
    aW->iRequest = aRequest;

    // Setup SPI for this configuration
    ISPIConfig(aW, aRequest);

    // Start SPI
    ISPIStart(aRequest);

    // Note we are in the middle of a transaction
    aW->iIsBusy = ETrue;

    // Allow receive half full, receive idle, and transmit half empty interrupts
    p->iFIFOINTENSET = (1<<2) | (1<<3);

    // Prime the pump and output in an amount of data
    // On interrupting, we'll feed in the data
    ISPIOutput(aW);

    // Now allow processing of the interrupts (which probably just occurred)
    InterruptEnable(aW->iIRQChannel);

    return UEZ_ERROR_NONE;
}

static TBool LPC546xx_SPI_IsBusy(void *aWorkspace)
{
    T_LPC546xx_SPI_Workspace *aW = (T_LPC546xx_SPI_Workspace *)aWorkspace;

    return aW->iIsBusy;
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_SPI SPI_LPC546xx_Port6_Interface = {
        {
        "NXP:LPC546xx:SPI6",
        0x0202,
        LPC546xx_SPI_SPI6_InitializeWorkspace,
        sizeof(T_LPC546xx_SPI_Workspace),
        },

        LPC546xx_SPI_TransferPolled,

        LPC546xx_SPI_Start,
        LPC546xx_SPI_TransferInOut,
        LPC546xx_SPI_Stop,
        LPC546xx_SPI_TransferInOutBytes,

        // uEZ v2.02
        LPC546xx_SPI_TransferNoBlock,
        LPC546xx_SPI_IsBusy,
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC546xx_SPI6_Require(
        T_uezGPIOPortPin aPinSCK6,
        T_uezGPIOPortPin aPinMISO6,
        T_uezGPIOPortPin aPinMOSI6,
        T_uezGPIOPortPin aPinSSEL6)
{

    HAL_DEVICE_REQUIRE_ONCE();

    static const T_LPC546xx_ICON_ConfigList miso6[] = {
            {GPIO_P4_3      , IOCON_D_DEFAULT(2)},
    };
    static const T_LPC546xx_ICON_ConfigList mosi6[] = {
            {GPIO_P4_2      , IOCON_D_DEFAULT(2)},
    };
    static const T_LPC546xx_ICON_ConfigList sck6[] = {
            {GPIO_P4_1      , IOCON_D_DEFAULT(2)},
    };
    static const T_LPC546xx_ICON_ConfigList ssel6[] = {
            {GPIO_P4_0      , IOCON_D_DEFAULT(2)},
    };

    // Register SPI1
    HALInterfaceRegister("SPI6",
            (T_halInterface *)&SPI_LPC546xx_Port6_Interface, 0, 0);

    LPC546xx_ICON_ConfigPinOrNone(aPinSCK6, sck6, ARRAY_COUNT(sck6));
    LPC546xx_ICON_ConfigPinOrNone(aPinSSEL6, ssel6, ARRAY_COUNT(ssel6));
    LPC546xx_ICON_ConfigPinOrNone(aPinMISO6, miso6, ARRAY_COUNT(miso6));
    LPC546xx_ICON_ConfigPinOrNone(aPinMOSI6, mosi6, ARRAY_COUNT(mosi6));

    //Setup and lock the Flexcomm for SPI mode
    LPC546xxPowerOn(kCLOCK_FlexComm6);
    SYSCON->FCLKSEL[6] = 0x03; //Main clock
    FLEXCOMM6->PID = (1<<3) | 0x02; //Lock, SPI mode

    // Setup interrupt, but do not enable
    InterruptRegister(FLEXCOMM6_IRQn, ISPI6IRQ, INTERRUPT_PRIORITY_HIGH, "SPI6");
    InterruptDisable(FLEXCOMM6_IRQn);
}


/*-------------------------------------------------------------------------*
 * End of File:  SPI.c
 *-------------------------------------------------------------------------*/

